In [25]:
import pandas as pd
import sqlalchemy
import pprint
import psycopg2
import matplotlib.pyplot as plt
%matplotlib inline
from config import password

In [26]:
#Creating engine
engine = create_engine(f'postgresql+psycopg2://postgres:{password}@localhost:5432/Employee_Db')
conn = engine.connect()
conn

In [42]:
employee_number = pd.read_sql("SELECT employees.emp_no,employees.last_name,employees.first_name, employees.sex,salaries.salary FROM employees LEFT JOIN salaries on employees.emp_no= salaries.emp_no ORDER BY emp_no", conn)
employee_number.head(5)

   emp_no last_name first_name sex  salary
0   10001   Facello     Georgi   M   60117
1   10002    Simmel    Bezalel   F   65828
2   10003   Bamford      Parto   M   40006
3   10004   Koblick  Chirstian   M   40054
4   10005  Maliniak    Kyoichi   M   78228

In [48]:
list_manager = pd.read_sql("SELECT dept_manager.dept_no, departments.dept_name, dept_manager.emp_no, employees.last_name, employees.first_name FROM  dept_manager JOIN departments on dept_manager.dept_no = departments.dept_no JOIN employees on dept_manager.emp_no = employees.emp_no", conn)

list_manager

   dept_no           dept_name  emp_no     last_name   first_name
0     d001           Marketing  110022    Markovitch    Margareta
1     d001           Marketing  110039      Minakawa     Vishwani
2     d002             Finance  110085         Alpin         Ebru
3     d002             Finance  110114    Legleitner        Isamu
4     d003     Human Resources  110183  Ossenbruggen      Shirish
5     d003     Human Resources  110228       Sigstam      Karsten
6     d004          Production  110303       Wegerle    Krassimir
7     d004          Production  110344         Cools       Rosine
8     d004          Production  110386        Kieras         Shem
9     d004          Production  110420      Ghazalie        Oscar
10    d005         Development  110511      Hagimont     DeForest
11    d005         Development  110567      DasSarma         Leon
12    d006  Quality Management  110725       Onuegbe    Peternela
13    d006  Quality Management  110765       Hofmeyr       Rutger
14    d006  Quality Management  110800       Quadeer       Sanjoy
15    d006  Quality Management  110854         Pesch         Dung
16    d007               Sales  111035     Kaelbling  Przemyslawa
17    d007               Sales  111133         Zhang        Hauke
18    d008            Research  111400       Staelin         Arie
19    d008            Research  111534        Kambil       Hilary
20    d009    Customer Service  111692   Butterworth        Tonny
21    d009    Customer Service  111784    Giarratana        Marjo
22    d009    Customer Service  111877      Spinelli      Xiaobin
23    d009    Customer Service  111939       Weedman      Yuchang

In [40]:
frequency_counts = pd.read_sql("SELECT last_name, COUNT(*) AS freq_count FROM employees GROUP BY last_name ORDER BY freq_count DESC", conn)
frequency_counts.head(10)

  last_name  freq_count
0      Baba         226
1    Gelosh         223
2     Coorg         223
3    Farris         222
4   Sudbeck         222
5    Adachi         221
6    Osgood         220
7    Masada         218
8   Mandell         218
9    Neiman         218